;Place localized text in this file

;*************************************************************************
[Rookie X2SoldierClassTemplate]
+DisplayName="新兵"
RankNames[0]="新兵"
ShortNames[0]="新兵"
;*************************************************************************
[Jeow_Rifleman X2SoldierClassTemplate]
+DisplayName="步枪手"
+ClassSummary="XCOM的步枪手是他们步兵部队的主力；他们可以在战场上进行突击，射击和急救。"
+LeftAbilityTreeTitle="袭击者"
+RightAbilityTreeTitle="医疗兵"
+AbilityTreeTitles[0]="袭击者"
+AbilityTreeTitles[1]="精确射手"
+AbilityTreeTitles[2]="医疗兵"
+AbilityTreeTitles[3]="毅力"

RankNames[0]="新兵"
RankNames[1]="候补军官"
RankNames[2]="列兵"
RankNames[3]="一等兵"
RankNames[4]="上等兵"
RankNames[5]="下士"
RankNames[6]="中士"
RankNames[7]="上士"
RankNames[8]="军士长"

ShortNames[0]="新兵"
ShortNames[1]="候补军官"
ShortNames[2]="列兵"
ShortNames[3]="一等兵"
ShortNames[4]="上等兵"
ShortNames[5]="下士"
ShortNames[6]="中士"
ShortNames[7]="上士"
ShortNames[8]="军士长"

;*************************************************************************
[Jeow_Recon X2SoldierClassTemplate]
+DisplayName="特种侦察兵"
+ClassSummary="侦查单位由狙击手、观察员和侦查兵组成；最适合进行隐秘的渗透和突然的致命打击。"
+LeftAbilityTreeTitle="狙击手"
+RightAbilityTreeTitle="侦察"
+AbilityTreeTitles[0]="狙击手"
+AbilityTreeTitles[1]="观察员"
+AbilityTreeTitles[2]="侦察"
+AbilityTreeTitles[3]="纪律"

RankNames[0]="新兵"
RankNames[1]="候补军官"
RankNames[2]="列兵"
RankNames[3]="一等兵"
RankNames[4]="上等兵"
RankNames[5]="下士"
RankNames[6]="中士"
RankNames[7]="上士"
RankNames[8]="军士长"

ShortNames[0]="新兵"
ShortNames[1]="候补军官"
ShortNames[2]="列兵"
ShortNames[3]="一等兵"
ShortNames[4]="上等兵"
ShortNames[5]="下士"
ShortNames[6]="中士"
ShortNames[7]="上士"
ShortNames[8]="军士长"

;*************************************************************************
[Jeow_Support X2SoldierClassTemplate]
+DisplayName="火力支援兵"
+ClassSummary="这些士兵是对他们步兵同行的补充力量；他们利用射术、侧翼攻击和无情的火力支援来压倒敌人。"
+LeftAbilityTreeTitle="枪手"
+RightAbilityTreeTitle="火力支援"
+AbilityTreeTitles[0]="枪手"
+AbilityTreeTitles[1]="冲刺"
+AbilityTreeTitles[2]="火力支援"
+AbilityTreeTitles[3]="教条"

RankNames[0]="新兵"
RankNames[1]="候补军官"
RankNames[2]="列兵"
RankNames[3]="一等兵"
RankNames[4]="上等兵"
RankNames[5]="下士"
RankNames[6]="中士"
RankNames[7]="上士"
RankNames[8]="军士长"

ShortNames[0]="新兵"
ShortNames[1]="候补军官"
ShortNames[2]="列兵"
ShortNames[3]="一等兵"
ShortNames[4]="上等兵"
ShortNames[5]="下士"
ShortNames[6]="中士"
ShortNames[7]="上士"
ShortNames[8]="军士长"

;*************************************************************************
[Jeow_Engineer X2SoldierClassTemplate]
+DisplayName="战斗工兵"
+ClassSummary="这些士兵是突击队的爆破专家；他们利用各种设备和战术来摧毁对手。"
+LeftAbilityTreeTitle="破坏者"
+RightAbilityTreeTitle="毁灭"
+AbilityTreeTitles[0]="破坏者"
+AbilityTreeTitles[1]="掷弹兵"
+AbilityTreeTitles[2]="毁灭"
+AbilityTreeTitles[3]="热诚"

RankNames[0]="新兵"
RankNames[1]="候补军官"
RankNames[2]="列兵"
RankNames[3]="一等兵"
RankNames[4]="上等兵"
RankNames[5]="下士"
RankNames[6]="中士"
RankNames[7]="上士"
RankNames[8]="军士长"

ShortNames[0]="新兵"
ShortNames[1]="候补军官"
ShortNames[2]="列兵"
ShortNames[3]="一等兵"
ShortNames[4]="上等兵"
ShortNames[5]="下士"
ShortNames[6]="中士"
ShortNames[7]="上士"
ShortNames[8]="军士长"

;*************************************************************************
[Jeow_TeamLeader X2SoldierClassTemplate]
+DisplayName="小队长"
+ClassSummary="XCOM的小队长是小队级别的指挥官；他们实施一系列灵活的战术以取得最终的成功。"
+LeftAbilityTreeTitle="目标"
+RightAbilityTreeTitle="防御"
+AbilityTreeTitles[0]="目标"
+AbilityTreeTitles[1]="侵略"
+AbilityTreeTitles[2]="防御"
+AbilityTreeTitles[3]="战术"

RankNames[0]="新兵"
RankNames[1]="候补军官"
RankNames[2]="列兵"
RankNames[3]="一等兵"
RankNames[4]="上等兵"
RankNames[5]="下士"
RankNames[6]="中士"
RankNames[7]="上士"
RankNames[8]="军士长"

ShortNames[0]="新兵"
ShortNames[1]="候补军官"
ShortNames[2]="列兵"
ShortNames[3]="一等兵"
ShortNames[4]="上等兵"
ShortNames[5]="下士"
ShortNames[6]="中士"
ShortNames[7]="上士"
ShortNames[8]="军士长"

;*************************************************************************
;*************************************************************************
;*************************************************************************
